Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/include/pio/pic32ck2051gc00144.h
#define PIN_PD08I_SDMMC0_SDDAT2                    _UINT32_(104)
#define MUX_PD08I_SDMMC0_SDDAT2                    _UINT32_(8) 
#define PINMUX_PD08I_SDMMC0_SDDAT2                 ((PIN_PD08I_SDMMC0_SDDAT2 << 16) | MUX_PD08I_SDMMC0_SDDAT2)
#define PORT_PD08I_SDMMC0_SDDAT2                   (_UINT32_(1) << 8)

#define PIN_PD09I_SDMMC0_SDDAT3                    _UINT32_(105)
#define MUX_PD09I_SDMMC0_SDDAT3                    _UINT32_(8) 
#define PINMUX_PD09I_SDMMC0_SDDAT3                 ((PIN_PD09I_SDMMC0_SDDAT3 << 16) | MUX_PD09I_SDMMC0_SDDAT3)
#define PORT_PD09I_SDMMC0_SDDAT3                   (_UINT32_(1) << 9)

#define PIN_PB00I_SDMMC0_SDWP                      _UINT32_(32)
#define MUX_PB00I_SDMMC0_SDWP                      _UINT32_(8) 
#define PINMUX_PB00I_SDMMC0_SDWP                   ((PIN_PB00I_SDMMC0_SDWP << 16) | MUX_PB00I_SDMMC0_SDWP)
#define PORT_PB00I_SDMMC0_SDWP                     (_UINT32_(1) << 0)

#define PIN_PD05I_SDMMC0_SDWP                      _UINT32_(101)
#define MUX_PD05I_SDMMC0_SDWP                      _UINT32_(8) 
#define PINMUX_PD05I_SDMMC0_SDWP                   ((PIN_PD05I_SDMMC0_SDWP << 16) | MUX_PD05I_SDMMC0_SDWP)
#define PORT_PD05I_SDMMC0_SDWP                     (_UINT32_(1) << 5)

/* ========== PORT definition for SDMMC1 peripheral ========== */
#define PIN_PC04I_SDMMC1_SDCD                      _UINT32_(68)
#define MUX_PC04I_SDMMC1_SDCD                      _UINT32_(8) 
#define PINMUX_PC04I_SDMMC1_SDCD                   ((PIN_PC04I_SDMMC1_SDCD << 16) | MUX_PC04I_SDMMC1_SDCD)
#define PORT_PC04I_SDMMC1_SDCD                     (_UINT32_(1) << 4)

#define PIN_PC05I_SDMMC1_SDCK                      _UINT32_(69)
#define MUX_PC05I_SDMMC1_SDCK                      _UINT32_(8) 
#define PINMUX_PC05I_SDMMC1_SDCK                   ((PIN_PC05I_SDMMC1_SDCK << 16) | MUX_PC05I_SDMMC1_SDCK)
#define PORT_PC05I_SDMMC1_SDCK                     (_UINT32_(1) << 5)

#define PIN_PB07I_SDMMC1_SDCMD                     _UINT32_(39)
#define MUX_PB07I_SDMMC1_SDCMD                     _UINT32_(8) 
#define PINMUX_PB07I_SDMMC1_SDCMD                  ((PIN_PB07I_SDMMC1_SDCMD << 16) | MUX_PB07I_SDMMC1_SDCMD)
#define PORT_PB07I_SDMMC1_SDCMD                    (_UINT32_(1) << 7)

#define PIN_PB10I_SDMMC1_SDDAT0                    _UINT32_(42)
#define MUX_PB10I_SDMMC1_SDDAT0                    _UINT32_(8) 
#define PINMUX_PB10I_SDMMC1_SDDAT0                 ((PIN_PB10I_SDMMC1_SDDAT0 << 16) | MUX_PB10I_SDMMC1_SDDAT0)
#define PORT_PB10I_SDMMC1_SDDAT0                   (_UINT32_(1) << 10)

#define PIN_PC00I_SDMMC1_SDDAT1                    _UINT32_(64)
#define MUX_PC00I_SDMMC1_SDDAT1                    _UINT32_(8) 
#define PINMUX_PC00I_SDMMC1_SDDAT1                 ((PIN_PC00I_SDMMC1_SDDAT1 << 16) | MUX_PC00I_SDMMC1_SDDAT1)
#define PORT_PC00I_SDMMC1_SDDAT1                   (_UINT32_(1) << 0)

#define PIN_PC01I_SDMMC1_SDDAT2                    _UINT32_(65)
#define MUX_PC01I_SDMMC1_SDDAT2                    _UINT32_(8) 
#define PINMUX_PC01I_SDMMC1_SDDAT2                 ((PIN_PC01I_SDMMC1_SDDAT2 << 16) | MUX_PC01I_SDMMC1_SDDAT2)
#define PORT_PC01I_SDMMC1_SDDAT2                   (_UINT32_(1) << 1)

#define PIN_PC02I_SDMMC1_SDDAT3                    _UINT32_(66)
#define MUX_PC02I_SDMMC1_SDDAT3                    _UINT32_(8) 
#define PINMUX_PC02I_SDMMC1_SDDAT3                 ((PIN_PC02I_SDMMC1_SDDAT3 << 16) | MUX_PC02I_SDMMC1_SDDAT3)
#define PORT_PC02I_SDMMC1_SDDAT3                   (_UINT32_(1) << 2)

#define PIN_PC03I_SDMMC1_SDWP                      _UINT32_(67)
#define MUX_PC03I_SDMMC1_SDWP                      _UINT32_(8) 
#define PINMUX_PC03I_SDMMC1_SDWP                   ((PIN_PC03I_SDMMC1_SDWP << 16) | MUX_PC03I_SDMMC1_SDWP)
#define PORT_PC03I_SDMMC1_SDWP                     (_UINT32_(1) << 3)

/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PC10C_SERCOM0_PAD0                     _UINT32_(74)
#define MUX_PC10C_SERCOM0_PAD0                     _UINT32_(2) 
#define PINMUX_PC10C_SERCOM0_PAD0                  ((PIN_PC10C_SERCOM0_PAD0 << 16) | MUX_PC10C_SERCOM0_PAD0)
#define PORT_PC10C_SERCOM0_PAD0                    (_UINT32_(1) << 10)

#define PIN_PD06C_SERCOM0_PAD0                     _UINT32_(102)
#define MUX_PD06C_SERCOM0_PAD0                     _UINT32_(2) 
#define PINMUX_PD06C_SERCOM0_PAD0                  ((PIN_PD06C_SERCOM0_PAD0 << 16) | MUX_PD06C_SERCOM0_PAD0)
#define PORT_PD06C_SERCOM0_PAD0                    (_UINT32_(1) << 6)

#define PIN_PD17C_SERCOM0_PAD0                     _UINT32_(113)
#define MUX_PD17C_SERCOM0_PAD0                     _UINT32_(2) 
#define PINMUX_PD17C_SERCOM0_PAD0                  ((PIN_PD17C_SERCOM0_PAD0 << 16) | MUX_PD17C_SERCOM0_PAD0)
#define PORT_PD17C_SERCOM0_PAD0                    (_UINT32_(1) << 17)

#define PIN_PC11C_SERCOM0_PAD1                     _UINT32_(75)
#define MUX_PC11C_SERCOM0_PAD1                     _UINT32_(2) 
#define PINMUX_PC11C_SERCOM0_PAD1                  ((PIN_PC11C_SERCOM0_PAD1 << 16) | MUX_PC11C_SERCOM0_PAD1)
#define PORT_PC11C_SERCOM0_PAD1                    (_UINT32_(1) << 11)

#define PIN_PD07C_SERCOM0_PAD1                     _UINT32_(103)
#define MUX_PD07C_SERCOM0_PAD1                     _UINT32_(2) 
#define PINMUX_PD07C_SERCOM0_PAD1                  ((PIN_PD07C_SERCOM0_PAD1 << 16) | MUX_PD07C_SERCOM0_PAD1)
#define PORT_PD07C_SERCOM0_PAD1                    (_UINT32_(1) << 7)

#define PIN_PD18C_SERCOM0_PAD1                     _UINT32_(114)
#define MUX_PD18C_SERCOM0_PAD1                     _UINT32_(2) 
#define PINMUX_PD18C_SERCOM0_PAD1                  ((PIN_PD18C_SERCOM0_PAD1 << 16) | MUX_PD18C_SERCOM0_PAD1)
#define PORT_PD18C_SERCOM0_PAD1                    (_UINT32_(1) << 18)

#define PIN_PC12C_SERCOM0_PAD2                     _UINT32_(76)
#define MUX_PC12C_SERCOM0_PAD2                     _UINT32_(2) 
#define PINMUX_PC12C_SERCOM0_PAD2                  ((PIN_PC12C_SERCOM0_PAD2 << 16) | MUX_PC12C_SERCOM0_PAD2)
#define PORT_PC12C_SERCOM0_PAD2                    (_UINT32_(1) << 12)

#define PIN_PD05C_SERCOM0_PAD2                     _UINT32_(101)
#define MUX_PD05C_SERCOM0_PAD2                     _UINT32_(2) 
#define PINMUX_PD05C_SERCOM0_PAD2                  ((PIN_PD05C_SERCOM0_PAD2 << 16) | MUX_PD05C_SERCOM0_PAD2)
#define PORT_PD05C_SERCOM0_PAD2                    (_UINT32_(1) << 5)

#define PIN_PD19C_SERCOM0_PAD2                     _UINT32_(115)
#define MUX_PD19C_SERCOM0_PAD2                     _UINT32_(2) 
#define PINMUX_PD19C_SERCOM0_PAD2                  ((PIN_PD19C_SERCOM0_PAD2 << 16) | MUX_PD19C_SERCOM0_PAD2)
#define PORT_PD19C_SERCOM0_PAD2                    (_UINT32_(1) << 19)

#define PIN_PC13C_SERCOM0_PAD3                     _UINT32_(77)
#define MUX_PC13C_SERCOM0_PAD3                     _UINT32_(2) 
#define PINMUX_PC13C_SERCOM0_PAD3                  ((PIN_PC13C_SERCOM0_PAD3 << 16) | MUX_PC13C_SERCOM0_PAD3)
#define PORT_PC13C_SERCOM0_PAD3                    (_UINT32_(1) << 13)

#define PIN_PD12C_SERCOM0_PAD3                     _UINT32_(108)
#define MUX_PD12C_SERCOM0_PAD3                     _UINT32_(2) 
#define PINMUX_PD12C_SERCOM0_PAD3                  ((PIN_PD12C_SERCOM0_PAD3 << 16) | MUX_PD12C_SERCOM0_PAD3)
#define PORT_PD12C_SERCOM0_PAD3                    (_UINT32_(1) << 12)

#define PIN_PD20C_SERCOM0_PAD3                     _UINT32_(116)
#define MUX_PD20C_SERCOM0_PAD3                     _UINT32_(2) 
#define PINMUX_PD20C_SERCOM0_PAD3                  ((PIN_PD20C_SERCOM0_PAD3 << 16) | MUX_PD20C_SERCOM0_PAD3)
#define PORT_PD20C_SERCOM0_PAD3                    (_UINT32_(1) << 20)

/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_PD08C_SERCOM1_PAD0                     _UINT32_(104)
#define MUX_PD08C_SERCOM1_PAD0                     _UINT32_(2) 
#define PINMUX_PD08C_SERCOM1_PAD0                  ((PIN_PD08C_SERCOM1_PAD0 << 16) | MUX_PD08C_SERCOM1_PAD0)
#define PORT_PD08C_SERCOM1_PAD0                    (_UINT32_(1) << 8)

#define PIN_PD13C_SERCOM1_PAD0                     _UINT32_(109)
#define MUX_PD13C_SERCOM1_PAD0                     _UINT32_(2) 
#define PINMUX_PD13C_SERCOM1_PAD0                  ((PIN_PD13C_SERCOM1_PAD0 << 16) | MUX_PD13C_SERCOM1_PAD0)
#define PORT_PD13C_SERCOM1_PAD0                    (_UINT32_(1) << 13)

#define PIN_PD09C_SERCOM1_PAD1                     _UINT32_(105)
#define MUX_PD09C_SERCOM1_PAD1                     _UINT32_(2) 
#define PINMUX_PD09C_SERCOM1_PAD1                  ((PIN_PD09C_SERCOM1_PAD1 << 16) | MUX_PD09C_SERCOM1_PAD1)
#define PORT_PD09C_SERCOM1_PAD1                    (_UINT32_(1) << 9)

