Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.121/PIC32CK-GC00/include/pio/pic32ck2051gc00144.h
/* ========== PORT definition for SERCOM6 peripheral ========== */
#define PIN_PA00D_SERCOM6_PAD0                     _UINT32_(0) 
#define MUX_PA00D_SERCOM6_PAD0                     _UINT32_(3) 
#define PINMUX_PA00D_SERCOM6_PAD0                  ((PIN_PA00D_SERCOM6_PAD0 << 16) | MUX_PA00D_SERCOM6_PAD0)
#define PORT_PA00D_SERCOM6_PAD0                    (_UINT32_(1) << 0)

#define PIN_PA18D_SERCOM6_PAD0                     _UINT32_(18)
#define MUX_PA18D_SERCOM6_PAD0                     _UINT32_(3) 
#define PINMUX_PA18D_SERCOM6_PAD0                  ((PIN_PA18D_SERCOM6_PAD0 << 16) | MUX_PA18D_SERCOM6_PAD0)
#define PORT_PA18D_SERCOM6_PAD0                    (_UINT32_(1) << 18)

#define PIN_PA07C_SERCOM6_PAD0                     _UINT32_(7) 
#define MUX_PA07C_SERCOM6_PAD0                     _UINT32_(2) 
#define PINMUX_PA07C_SERCOM6_PAD0                  ((PIN_PA07C_SERCOM6_PAD0 << 16) | MUX_PA07C_SERCOM6_PAD0)
#define PORT_PA07C_SERCOM6_PAD0                    (_UINT32_(1) << 7)

#define PIN_PA01D_SERCOM6_PAD1                     _UINT32_(1) 
#define MUX_PA01D_SERCOM6_PAD1                     _UINT32_(3) 
#define PINMUX_PA01D_SERCOM6_PAD1                  ((PIN_PA01D_SERCOM6_PAD1 << 16) | MUX_PA01D_SERCOM6_PAD1)
#define PORT_PA01D_SERCOM6_PAD1                    (_UINT32_(1) << 1)

#define PIN_PA28D_SERCOM6_PAD1                     _UINT32_(28)
#define MUX_PA28D_SERCOM6_PAD1                     _UINT32_(3) 
#define PINMUX_PA28D_SERCOM6_PAD1                  ((PIN_PA28D_SERCOM6_PAD1 << 16) | MUX_PA28D_SERCOM6_PAD1)
#define PORT_PA28D_SERCOM6_PAD1                    (_UINT32_(1) << 28)

#define PIN_PA08C_SERCOM6_PAD1                     _UINT32_(8) 
#define MUX_PA08C_SERCOM6_PAD1                     _UINT32_(2) 
#define PINMUX_PA08C_SERCOM6_PAD1                  ((PIN_PA08C_SERCOM6_PAD1 << 16) | MUX_PA08C_SERCOM6_PAD1)
#define PORT_PA08C_SERCOM6_PAD1                    (_UINT32_(1) << 8)

#define PIN_PA02D_SERCOM6_PAD2                     _UINT32_(2) 
#define MUX_PA02D_SERCOM6_PAD2                     _UINT32_(3) 
#define PINMUX_PA02D_SERCOM6_PAD2                  ((PIN_PA02D_SERCOM6_PAD2 << 16) | MUX_PA02D_SERCOM6_PAD2)
#define PORT_PA02D_SERCOM6_PAD2                    (_UINT32_(1) << 2)

#define PIN_PA19D_SERCOM6_PAD2                     _UINT32_(19)
#define MUX_PA19D_SERCOM6_PAD2                     _UINT32_(3) 
#define PINMUX_PA19D_SERCOM6_PAD2                  ((PIN_PA19D_SERCOM6_PAD2 << 16) | MUX_PA19D_SERCOM6_PAD2)
#define PORT_PA19D_SERCOM6_PAD2                    (_UINT32_(1) << 19)

#define PIN_PA09C_SERCOM6_PAD2                     _UINT32_(9) 
#define MUX_PA09C_SERCOM6_PAD2                     _UINT32_(2) 
#define PINMUX_PA09C_SERCOM6_PAD2                  ((PIN_PA09C_SERCOM6_PAD2 << 16) | MUX_PA09C_SERCOM6_PAD2)
#define PORT_PA09C_SERCOM6_PAD2                    (_UINT32_(1) << 9)

#define PIN_PA03D_SERCOM6_PAD3                     _UINT32_(3) 
#define MUX_PA03D_SERCOM6_PAD3                     _UINT32_(3) 
#define PINMUX_PA03D_SERCOM6_PAD3                  ((PIN_PA03D_SERCOM6_PAD3 << 16) | MUX_PA03D_SERCOM6_PAD3)
#define PORT_PA03D_SERCOM6_PAD3                    (_UINT32_(1) << 3)

#define PIN_PA09D_SERCOM6_PAD3                     _UINT32_(9) 
#define MUX_PA09D_SERCOM6_PAD3                     _UINT32_(3) 
#define PINMUX_PA09D_SERCOM6_PAD3                  ((PIN_PA09D_SERCOM6_PAD3 << 16) | MUX_PA09D_SERCOM6_PAD3)
#define PORT_PA09D_SERCOM6_PAD3                    (_UINT32_(1) << 9)

#define PIN_PA10C_SERCOM6_PAD3                     _UINT32_(10)
#define MUX_PA10C_SERCOM6_PAD3                     _UINT32_(2) 
#define PINMUX_PA10C_SERCOM6_PAD3                  ((PIN_PA10C_SERCOM6_PAD3 << 16) | MUX_PA10C_SERCOM6_PAD3)
#define PORT_PA10C_SERCOM6_PAD3                    (_UINT32_(1) << 10)

/* ========== PORT definition for SERCOM7 peripheral ========== */
#define PIN_PA12D_SERCOM7_PAD0                     _UINT32_(12)
#define MUX_PA12D_SERCOM7_PAD0                     _UINT32_(3) 
#define PINMUX_PA12D_SERCOM7_PAD0                  ((PIN_PA12D_SERCOM7_PAD0 << 16) | MUX_PA12D_SERCOM7_PAD0)
#define PORT_PA12D_SERCOM7_PAD0                    (_UINT32_(1) << 12)

#define PIN_PB18D_SERCOM7_PAD0                     _UINT32_(50)
#define MUX_PB18D_SERCOM7_PAD0                     _UINT32_(3) 
#define PINMUX_PB18D_SERCOM7_PAD0                  ((PIN_PB18D_SERCOM7_PAD0 << 16) | MUX_PB18D_SERCOM7_PAD0)
#define PORT_PB18D_SERCOM7_PAD0                    (_UINT32_(1) << 18)

#define PIN_PA21C_SERCOM7_PAD0                     _UINT32_(21)
#define MUX_PA21C_SERCOM7_PAD0                     _UINT32_(2) 
#define PINMUX_PA21C_SERCOM7_PAD0                  ((PIN_PA21C_SERCOM7_PAD0 << 16) | MUX_PA21C_SERCOM7_PAD0)
#define PORT_PA21C_SERCOM7_PAD0                    (_UINT32_(1) << 21)

#define PIN_PA01C_SERCOM7_PAD0                     _UINT32_(1) 
#define MUX_PA01C_SERCOM7_PAD0                     _UINT32_(2) 
#define PINMUX_PA01C_SERCOM7_PAD0                  ((PIN_PA01C_SERCOM7_PAD0 << 16) | MUX_PA01C_SERCOM7_PAD0)
#define PORT_PA01C_SERCOM7_PAD0                    (_UINT32_(1) << 1)

#define PIN_PA11D_SERCOM7_PAD1                     _UINT32_(11)
#define MUX_PA11D_SERCOM7_PAD1                     _UINT32_(3) 
#define PINMUX_PA11D_SERCOM7_PAD1                  ((PIN_PA11D_SERCOM7_PAD1 << 16) | MUX_PA11D_SERCOM7_PAD1)
#define PORT_PA11D_SERCOM7_PAD1                    (_UINT32_(1) << 11)

#define PIN_PB12D_SERCOM7_PAD1                     _UINT32_(44)
#define MUX_PB12D_SERCOM7_PAD1                     _UINT32_(3) 
#define PINMUX_PB12D_SERCOM7_PAD1                  ((PIN_PB12D_SERCOM7_PAD1 << 16) | MUX_PB12D_SERCOM7_PAD1)
#define PORT_PB12D_SERCOM7_PAD1                    (_UINT32_(1) << 12)

#define PIN_PA04C_SERCOM7_PAD1                     _UINT32_(4) 
#define MUX_PA04C_SERCOM7_PAD1                     _UINT32_(2) 
#define PINMUX_PA04C_SERCOM7_PAD1                  ((PIN_PA04C_SERCOM7_PAD1 << 16) | MUX_PA04C_SERCOM7_PAD1)
#define PORT_PA04C_SERCOM7_PAD1                    (_UINT32_(1) << 4)

#define PIN_PA20C_SERCOM7_PAD1                     _UINT32_(20)
#define MUX_PA20C_SERCOM7_PAD1                     _UINT32_(2) 
#define PINMUX_PA20C_SERCOM7_PAD1                  ((PIN_PA20C_SERCOM7_PAD1 << 16) | MUX_PA20C_SERCOM7_PAD1)
#define PORT_PA20C_SERCOM7_PAD1                    (_UINT32_(1) << 20)

